package com.anikonets.task5;

public class RusConfig {

    public final static String ZERO = "ноль";
    public final static String MINUS = "минус ";

    public final static String[][] RANK_NAME = new String[][]{
            {"0", "", "", ""},
            {"1", "тысяча ", "тысячи ", "тысяч "},
            {"0", "миллион ", "миллиона ", "миллионов "},
            {"0", "миллиард ", "миллиарда ", "миллиардов "},
    };

    public final static String[][] DIGIT_NAME = new String[][]{
            {"", "", "десять ", "", ""},
            {"один ", "одна ", "одиннадцать ", "десять ", "сто "},
            {"два ", "две ", "двенадцать ", "двадцать ", "двести "},
            {"три ", "три ", "тринадцать ", "тридцать ", "триста "},
            {"четыре ", "четыре ", "четырнадцать ", "сорок ", "четыреста "},
            {"пять ", "пять ", "пятнадцать ", "пятьдесят ", "пятьсот "},
            {"шесть ", "шесть ", "шестнадцать ", "шестьдесят ", "шестьсот "},
            {"семь ", "семь ", "семнадцать ", "семьдесят ", "семьсот "},
            {"восемь ", "восемь ", "восемнадцать ", "восемьдесят ", "восемьсот "},
            {"девять ", "девять ", "девятнадцать ", "девяносто ", "девятьсот "}
    };

}